#### Terraform Initialization : success`
#### Terraform Plan : success`
<details><summary>Show Plan</summary>

```

[0m[1maws_security_group.ga_lb_sg: Refreshing state... [id=sg-04b51d872f89b242e][0m
[0m[1maws_security_group.ga_db_sg: Refreshing state... [id=sg-0dc19d9d6d51e5013][0m
[0m[1maws_security_group.ga_app_sg: Refreshing state... [id=sg-095c4e6916897777f][0m
[0m[1maws_security_group_rule.allow_internet: Refreshing state... [id=sgrule-2013916262][0m
[0m[1maws_security_group_rule.allow_tcp_3306: Refreshing state... [id=sgrule-166697786][0m
[0m[1maws_security_group_rule.allow_tcp_443: Refreshing state... [id=sgrule-316698524][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_security_group.ga_app_sg[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "ga_app_sg" {
      [33m~[0m[0m arn                    = "arn:aws:ec2:ca-central-1:654654488989:security-group/sg-095c4e6916897777f" -> (known after apply)
      [33m~[0m[0m egress                 = [] -> (known after apply)
      [33m~[0m[0m id                     = "sg-095c4e6916897777f" -> (known after apply)
      [33m~[0m[0m ingress                = [
          [31m-[0m[0m {
              [31m-[0m[0m cidr_blocks      = []
              [31m-[0m[0m from_port        = 443
              [31m-[0m[0m ipv6_cidr_blocks = []
              [31m-[0m[0m prefix_list_ids  = []
              [31m-[0m[0m protocol         = "tcp"
              [31m-[0m[0m security_groups  = [
                  [31m-[0m[0m "sg-04b51d872f89b242e",
                ]
              [31m-[0m[0m self             = false
              [31m-[0m[0m to_port          = 443
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ] -> (known after apply)
      # [33mWarning[0m: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.[0m
      [33m~[0m[0m name                   = (sensitive value) [31m# forces replacement[0m[0m
      [32m+[0m[0m name_prefix            = (known after apply)
      [33m~[0m[0m owner_id               = "654654488989" -> (known after apply)
      [31m-[0m[0m tags                   = {} [90m-> null[0m[0m
      [33m~[0m[0m tags_all               = {} -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_security_group.ga_db_sg[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "ga_db_sg" {
      [33m~[0m[0m arn                    = "arn:aws:ec2:ca-central-1:654654488989:security-group/sg-0dc19d9d6d51e5013" -> (known after apply)
      [33m~[0m[0m egress                 = [] -> (known after apply)
      [33m~[0m[0m id                     = "sg-0dc19d9d6d51e5013" -> (known after apply)
      [33m~[0m[0m ingress                = [
          [31m-[0m[0m {
              [31m-[0m[0m cidr_blocks      = []
              [31m-[0m[0m from_port        = 3306
              [31m-[0m[0m ipv6_cidr_blocks = []
              [31m-[0m[0m prefix_list_ids  = []
              [31m-[0m[0m protocol         = "tcp"
              [31m-[0m[0m security_groups  = [
                  [31m-[0m[0m "sg-095c4e6916897777f",
                ]
              [31m-[0m[0m self             = false
              [31m-[0m[0m to_port          = 3306
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ] -> (known after apply)
      # [33mWarning[0m: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.[0m
      [33m~[0m[0m name                   = (sensitive value) [31m# forces replacement[0m[0m
      [32m+[0m[0m name_prefix            = (known after apply)
      [33m~[0m[0m owner_id               = "654654488989" -> (known after apply)
      [31m-[0m[0m tags                   = {} [90m-> null[0m[0m
      [33m~[0m[0m tags_all               = {} -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_security_group.ga_lb_sg[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group" "ga_lb_sg" {
      [33m~[0m[0m arn                    = "arn:aws:ec2:ca-central-1:654654488989:security-group/sg-04b51d872f89b242e" -> (known after apply)
      [33m~[0m[0m egress                 = [] -> (known after apply)
      [33m~[0m[0m id                     = "sg-04b51d872f89b242e" -> (known after apply)
      [33m~[0m[0m ingress                = [
          [31m-[0m[0m {
              [31m-[0m[0m cidr_blocks      = [
                  [31m-[0m[0m "0.0.0.0/0",
                ]
              [31m-[0m[0m from_port        = 443
              [31m-[0m[0m ipv6_cidr_blocks = []
              [31m-[0m[0m prefix_list_ids  = []
              [31m-[0m[0m protocol         = "tcp"
              [31m-[0m[0m security_groups  = []
              [31m-[0m[0m self             = false
              [31m-[0m[0m to_port          = 443
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ] -> (known after apply)
      # [33mWarning[0m: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.[0m
      [33m~[0m[0m name                   = (sensitive value) [31m# forces replacement[0m[0m
      [32m+[0m[0m name_prefix            = (known after apply)
      [33m~[0m[0m owner_id               = "654654488989" -> (known after apply)
      [31m-[0m[0m tags                   = {} [90m-> null[0m[0m
      [33m~[0m[0m tags_all               = {} -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_security_group_rule.allow_internet[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group_rule" "allow_internet" {
      [33m~[0m[0m id                       = "sgrule-2013916262" -> (known after apply)
      [33m~[0m[0m security_group_id        = "sg-04b51d872f89b242e" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m security_group_rule_id   = "sgr-00660377d9f1e7cb9" -> (known after apply)
      [32m+[0m[0m source_security_group_id = (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_security_group_rule.allow_tcp_3306[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group_rule" "allow_tcp_3306" {
      [33m~[0m[0m id                       = "sgrule-166697786" -> (known after apply)
      [33m~[0m[0m security_group_id        = "sg-0dc19d9d6d51e5013" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m security_group_rule_id   = "sgr-09499d59aa288f8a8" -> (known after apply)
      [33m~[0m[0m source_security_group_id = "sg-095c4e6916897777f" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_security_group_rule.allow_tcp_443[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_security_group_rule" "allow_tcp_443" {
      [33m~[0m[0m id                       = "sgrule-316698524" -> (known after apply)
      [33m~[0m[0m security_group_id        = "sg-095c4e6916897777f" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m security_group_rule_id   = "sgr-01552119120bdbe40" -> (known after apply)
      [33m~[0m[0m source_security_group_id = "sg-04b51d872f89b242e" [31m# forces replacement[0m[0m -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 6 to add, 0 to change, 6 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @cedricguindon, Action: `pull_request`*